# Terraform `environment` `test`
#### Initialization ⚙️`success`
#### Format and Style 🖌`success`
#### Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Plan 📖`success`

<details><summary>Show Plan</summary>

```

[Lines containing Refreshing state removed]
[Truncated to 120000 bytes! See logoutput for complete plan]
Acquiring state lock. This may take a few moments...
data.azurerm_client_config.current: Reading...
data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1jMjE3YTNlYS00MDJmLTQ4ODYtYWNlNS00NzhkYjcyYWI0Yzk7b2JqZWN0SWQ9Y2M3NWExY2MtZDZhMS00NTMwLTgyOGYtODY4MzJjZTkxYjliO3N1YnNjcmlwdGlvbklkPWNjNmI1ODg2LTM2YWYtNGQ1NC05ZDMwLTFiMGZmZmM3MzZkODt0ZW5hbnRJZD1jZDAwMjZkOC0yODNiLTRhNTUtOWJmYS1kMGVmNGE4YmEyMWM=]
module.observability.data.azurerm_client_config.current: Reading...
module.observability.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1jMjE3YTNlYS00MDJmLTQ4ODYtYWNlNS00NzhkYjcyYWI0Yzk7b2JqZWN0SWQ9Y2M3NWExY2MtZDZhMS00NTMwLTgyOGYtODY4MzJjZTkxYjliO3N1YnNjcmlwdGlvbklkPWNjNmI1ODg2LTM2YWYtNGQ1NC05ZDMwLTFiMGZmZmM3MzZkODt0ZW5hbnRJZD1jZDAwMjZkOC0yODNiLTRhNTUtOWJmYS1kMGVmNGE4YmEyMWM=]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.grafana.azurerm_role_assignment.grafana_editor["12b73376-8726-493c-8d27-aa87e5213e6b"] will be created
  + resource "azurerm_role_assignment" "grafana_editor" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "12b73376-8726-493c-8d27-aa87e5213e6b"
      + principal_type                   = "Group"
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Grafana Editor"
      + scope                            = "/subscriptions/cc6b5886-36af-4d54-9d30-1b0fffc736d8/resourceGroups/grafana-corr-at22-rg/providers/Microsoft.Dashboard/grafana/grafana-corr-at22"
      + skip_service_principal_aad_check = true
    }

  # module.grafana.azurerm_role_assignment.grafana_editor["9b99f951-3873-4310-8baf-464b4da43f26"] will be created
  + resource "azurerm_role_assignment" "grafana_editor" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "9b99f951-3873-4310-8baf-464b4da43f26"
      + principal_type                   = "Group"
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Grafana Editor"
      + scope                            = "/subscriptions/cc6b5886-36af-4d54-9d30-1b0fffc736d8/resourceGroups/grafana-corr-at22-rg/providers/Microsoft.Dashboard/grafana/grafana-corr-at22"
      + skip_service_principal_aad_check = true
    }

Plan: 2 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan.out

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan.out"
Releasing state lock. This may take a few moments...

```

</details>

| Context | Values |
| - | - |
| Pusher | @bengtfredh |
| Action | `workflow_dispatch` |
| Working Directory | `./infrastructure/altinn-correspondence-test/corr-at22-aks-rg` |
| State File | `github.com/altinn/altinn-platform/environments/test/corr-at22-aks-rg.tfstate` |
| Plan File | `github.com_altinn_altinn-platform_environments_test_corr-at22-aks-rg.tfstate.tfplan` |